# NoneOfSelElemsGroupable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..NoneOfSelElemsGroupable Property
BuiltInFailures..::..GroupFailures Class See Also
---
None of the selected elements can be grouped. The elements may already be grouped or may be element types which are not allowed for grouping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoneOfSelElemsGroupable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoneOfSelElemsGroupable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoneOfSelElemsGroupable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace